Artillery/postTest.yml
config:
  target: "http://localhost:3001"
  processor: "./processors.js"
  phases:
    - duration: 5
      arrivalRate: 1000
scenarios:
  - flow:
      - function: "post"
      - post:
          url: "/api/airbnb.users/"
          json:
            user_id: "{{user_id}}"
            name: "{{name}}"
            imageUrl: "{{imageUrl}}"
            body: "{{body}}"
            cleanliness: "{{cleanliness}}"
            communication: "{{communication}}"
            value: "{{value}}"
            accuracy: "{{accuracy}}"
            checkIn: "{{checkIn}}"
            location: "{{location}}"